# Updating DataFrames

## Data: Palmer Penguins

In [1]:
#import libraries
import pandas as pd
import numpy as np

import seaborn as sns
import random

In [2]:
#load in the data
penguins = sns.load_dataset('penguins')

In [3]:
#view the data
penguins.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

# Manipulating a dataframe

add a new column
```
df['newcolname'] = new_column values
```

New Column Values could be:
 - a `pd.Series` or `numpy.arrray`
 - a single scalar value

In [4]:
penguins['body_mass_kg'] = penguins.body_mass_g/1000

# confirm the new column is in the data frame
print('body_mass_kg' in penguins.columns)

# take a look at the new column
penguins.head()

True

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,body_mass_kg
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male,3.75
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female,3.80
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female,3.25
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female,3.45

To creat a new column and change where the new column is added, `use insert()`
```
df.insert(loc = integers_index,
column = 'new_column_name',
value = new_col_values) # location of new column
```

Suppose each penguin gets a unique three digit code as an identifier. Add this column to the dataframe:

In [6]:
#create random 3 digit codes
codes = random.sample(range(100,1000), len(penguins))

penguins.insert(loc = 0,
               column = 'code',
               value = codes)

In [7]:
penguins.head()

,code,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,body_mass_kg
0,425,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male,3.75
1,949,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female,3.80
2,997,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female,3.25
3,499,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,NaN
4,328,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female,3.45